ОУ/ДЗ2/Documents/КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

ОУ/ДЗ2/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ОУ/ДЗ2/Documents/КорректировкаРегистров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиНоменклатурыОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Дата, ) КАК ОстаткиНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ОБъект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СТрокаДвижения = Объект.Движения.ОстаткиНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, ВыборкаДетальныеЗаписи);
		СтрокаДвижения.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаДвижения.Активность = Истина;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	 ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры
